{
    "items": [
        {
            "title": "Knowledge-guided Continual Learning for Behavioral  Analytics Systems",
            "authors": "<strong>Yasas Senarath</strong>, Hemant Purohit",
            "year": 2025,
            "conference": "The 7th IEEE International Conference on Cognitive Machine Intelligence (CogMI)",
            "description": "This paper proposes a knowledge-guided continual learning framework that uses external knowledge to improve behavioral analytics systems. By augmenting replay-based learning with Wiktionary data, it reduces catastrophic forgetting and improves performance on evolving online behavior."
        },
        {
            "title": "Practitioner-Centric Approach for Early Incident Detection Using Crowdsourced Data for Emergency Services (Accepted)",
            "authors": "<strong>Yasas Senarath</strong>, Ayan Mukhopadhyay, Sayyed M Vazirizade, Hemant Purohit, Sadeep Nannapaneni, Abhishek Dubey",
            "year": 2021,
            "conference": "The IEEE International Conference on Data Mining (ICDM)",
            "description": "Presents a novel problem formulation and a practitioner-centered system design approach for incident detection modeling using crowdsourced data with a focus on emergency response management."
        },
        {
            "title": "Towards a Design of Resilience Data Repository for Community Resilience",
            "authors": "Hoang Long Nguyen, <strong>Yasas Senarath</strong>, Hemant Purohit, Rajendra Akerkar",
            "year": 2021,
            "conference": "International Conference on Information Systems for Crisis Response and Management (ISCRAM)",
            "description": "Community resilience is coming under scrutiny recently because of its need to support communities in preparing and protecting lives against risks and bouncing back to normal operations after disruptions. However, community resilience is an intricate concept that is arduous to capture and turn into explicit knowledge. This motivated us to propose a general architecture for a resilience data repository that enables communities to adopt a general methodology for collecting, storing, managing, and sharing resilience-based information."
        },
        {
            "title": "Evaluating the Relevance of UMLS Knowledge Base for Public Health Informatics during Disasters",
            "authors": "<strong>Yasas Senarath</strong>, Jennifer L Chan, Hemant Purohit, Özlem Uzuner",
            "year": 2021,
            "conference": "International Conference on Information Systems for Crisis Response and Management (ISCRAM)",
            "description": "During disasters public health organizations increasingly face challenges in acquiring and transforming real-time data into knowledge about the dynamic public health needs. Resources on the internet can provide valuable information for extracting knowledge that can help improve decisions which will ultimately result in targeted and efficient health services. Digital content such as online articles, blogs, and social media are some of such information sources that could be leveraged to improve the health care systems during disasters. To efficiently and accurately identify relevant disaster health information, extraction tools require a common vocabulary that is aligned to the health domain so that the knowledge from these unstructured digital sources can be accurately structured and organized. In this paper, we study the degree to which the Unified Medical Language System (UMLS) contains relevant disaster, public health, and medical concepts for which public health information in disaster domain could be extracted from digital sources."
        },
        {
            "title": "Mining Risk Behaviors from Social Media for Pandemic Crisis Preparedness and Response",
            "authors": "<strong>Yasas Senarath</strong>, Steve Peterson, Hemant Purohit, Amanda L. Hughes, Keri K. Stephens",
            "year": 2021,
            "conference": "International Conference on Social Computing, Behavioral-Cultural Modeling & Prediction and Behavior Representation in Modeling and Simulation (SBP-BRiMS)",
            "description": "Developed an approach to automatically infer the risk behavior from social media posts using machine learning models for COVID-19 pandemic."
        },
        {
            "title": "Efficient Detection of Multilingual Hate Speech by Using Interactive Attention Network with Minimal Human Feedback",
            "authors": "Fedor Vitiugin, <strong>Yasas Senarath</strong>, Hemant Purohit",
            "year": 2021,
            "conference": "ACM Web Science Conference",
            "description": "In this paper, we propose a Multilingual Interactive Attention Network (MLIAN) model for hate speech detection on multilingual social media text corpora, by building upon the attention networks for interpretability and human-in-the-loop paradigm for model adaptability. This model interactively learns to give attention to the relevant contextual words and leverage the labels for the hate target mentions from the simulated human feedback."
        },
        {
            "title": "Online-Computer-Mediated Interviews and Observations: Overcoming Challenges and Establishing Best Practices in a Human-AI Teaming Context",
            "authors": "Keri Stephens, Karim Nader, Amanda Hughes, Anastazja Harris, Caroline Montagnolo, Ashley Stevens, <strong>Yasas Senarath</strong>, Hemant Purohit",
            "year": 2021,
            "conference": "Hawaii International Conference on System Sciences",
            "description": "Prior research has established the feasibility of conducting online interviews and observations, yet there is limited guidance in how to interact with participants when conducting fully mediated research with screen-sharing and video. This study, conducted during early phases of COVID-19, included 15 volunteer tweet annotators working with an emergency response organization. This method contribution uses cues-related and surveillance theories to reveal challenges and best practices when asking research participants to share their screen, be on video, and participate in a multiple-interview study. The findings suggest that researchers conducting online-mediated research should be prepared to provide technical support for the devices and interfaces participants use during the study, find ways to “see” beyond what is on the mediated screen, and consider ethical issues not often discussed. In addition to these findings, an output of this research is two brief training videos useful for other researchers embarking on conducting fully mediated research."
        },
        {
            "title": "Emergency Incident Detection from Crowdsourced Waze Data using Bayesian Information Fusion",
            "authors": "<strong>Yasas Senarath</strong>, Sadeep Nannapaneni, Hemant Purohit, Abhishek Dubey",
            "year": 2020,
            "conference": "IEEE/WIC/ACM International Joint Conference On Web Intelligence And Intelligent Agent Technology (WI-IAT)",
            "description": "The number of emergencies have increased over the years with the growth in urbanization. This pattern has overwhelmed the emergency services with limited resources and demands the optimization of response processes. It is partly due to traditional `reactive' approach of emergency services to collect data about incidents, where a source initiates a call to the emergency number (e.g., 911 in U.S.), delaying and limiting the potentially optimal response. Crowdsourcing platforms such as Waze provides an opportunity to develop a rapid, `proactive' approach to collect data about incidents through crowd-generated observational reports. However, the reliability of reporting sources and spatio-temporal uncertainty of the reported incidents challenge the design of such a proactive approach. Thus, this paper presents a novel method for emergency incident detection using noisy crowdsourced Waze data. We propose a principled computational framework based on Bayesian theory to model the uncertainty in the reliability of crowd-generated reports and their integration across space and time to detect incidents. Extensive experiments using data collected from Waze and the official reported incidents in Nashville, Tenessee in the U.S. show our method can outperform strong baselines for both F1-score and AUC. The application of this work provides an extensible framework to incorporate different noisy data sources for proactive incident detection to improve and optimize emergency response operations in our communities."
        },
        {
            "title": "Evaluating Semantic Feature Representations to Efficiently Detect Hate Intent on Social Media",
            "authors": "<strong>Yasas Senarath</strong>, Purohit, Hemant",
            "year": 2020,
            "conference": "14th International Conference on Semantic Computing (IEEE-ICSC)",
            "description": "Detecting malicious intent behavior such as sharing hate speech has become an important challenge for social networking platforms. The method of automated hate speech detection for social media posts is often challenged by the complexity of capturing the context of the user expression with potential hate intent. We hypothesize that semantic features can help enrich the context representation of word senses in a social media post for machine learning algorithms. This paper presents a novel empirical study of diverse semantic features for hate speech classification task on social media posts. Specifically, we present an extensive empirical analysis, where we test the features of vector space model representation for corpus-based semantics, neural word embedding representation for distributional semantics , and declarative knowledge patterns from external knowledge base for domain semantics. Our experimental results show that ensembling the diverse feature representations improves the efficiency of hateful behavior classification in contrast to the case of a single type of feature representation. Results on two popular Twitter datasets for the hate speech detection task showed a consistent performance gain for the classification models that were based on the hybrid feature representation (absolute gain in F 1 score up to 3.0%). The application of the proposed method of combining diverse feature representations can help in improving social media analytics systems for monitoring human behavior."
        },
        {
            "title": "A Hybrid Approach for Aspect Extraction from Customer Reviews",
            "authors": "<strong>Yasas Senarath</strong>, Nadheesh Jihan, Surangika Ranathunga",
            "year": 2019,
            "conference": "International Journal on Advances in ICT for Emerging Regions (ICTer)",
            "description": "Aspect Extraction from consumer reviews has become an essential factor for successful Aspect Based Sentiment Analysis. Typical user trends to mention his opinion against several aspects in a single review; therefore, aspect extraction has been tackled as a multi-label classification task. Due to its complexity and the variety across different domains, yet, no single system has been able to achieve comparable accuracy levels to the human-accuracy. However, novel neural network architectures and hybrid approaches have shown promising results for aspect extraction.Support Vector Machines (SVMs) and Convolutional Neural Networks (CNNs) pose a viable solution to the multi-label text classification task and has been successfully applied to identify aspects in reviews. In this paper, we first define an improved CNN architecture for aspect extraction which achieves comparable results against the current state-of-the-art systems. Then we propose a mixture of classifiers for aspect extraction, combining the proposed improved CNN with an SVM that uses the state-of-the-art manually engineered features. The combined system outperforms the results of individual systems while showing a significant improvement over the state-of-the-art aspect extraction systems that employ complex neural architectures such as MTNA."
        },
        {
            "title": "ACTSEA: annotated corpus for Tamil &amp; Sinhala emotion analysis",
            "authors": "Rajenthiran Jenarthanan, <strong>Yasas Senarath</strong>, Uthayasanker Thayasivam",
            "year": 2019,
            "conference": "Moratuwa Engineering Research Conference (MERCon)",
            "description": "The purpose of text emotion analysis is to detect and recognize the classification of feeling expressed in text. In recent years, there has been an increase in text emotion analysis studies for English language since data were abundant. Due to the growth of social media large amount data are now available for regional languages such as Tamil and Sinhala as well. However, these languages lack necessary annotated corpus for many NLP tasks including emotion analysis. In this paper, we present our scalable semi-automatic approach to create an annotated corpus named ACTSEA for Tamil and Sinhala to support emotion analysis. Alongside, our analysis on a sample of the produced data and the useful findings are presented for the low resourced NLP community to benefit. For ACTSEA, data were gathered from twitter platform and annotated manually after cleaning. We collected 600280 (Tamil) and 318308 (Sinhala) tweets in total which makes our corpus largest data collection which is currently available for these languages."
        },
        {
            "title": "Multiple Word Embedding based Models for Implicit Emotion Classification of Tweets with Deep Learning",
            "authors": "<strong>Yasas Senarath</strong>, Uthayasanker Thayasivam",
            "year": 2018,
            "conference": "9th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis (WASSA)",
            "description": "This paper describes an approach to solve implicit emotion classification with the use of pre-trained word embedding models to train multiple neural networks. The system described in this paper is composed of a sequential combination of Long Short-Term Memory and Convolutional Neural Network for feature extraction and Feedforward Neural Network for classification. In this paper, we successfully show that features extracted using multiple pre-trained embeddings can be used to improve the overall performance of the system with Emoji being one of the significant features. The evaluations show that our approach outperforms the baseline system by more than 8% without using any external corpus or lexicon. This approach is ranked 8th in Implicit Emotion Shared Task (IEST) at WASSA-2018."
        },
        {
            "title": "Aspect extraction from customer reviews using Convolutional Neural Networks",
            "authors": "Nadheesh Jihan, <strong>Yasas Senarath</strong>, Surangika Ranathunga",
            "year": 2018,
            "conference": "18th International Conference on Advances in ICT for Emerging Regions (ICTer)",
            "description": "Convolutional Neural Networks (CNN) have emerged as a viable solution for text classification, including aspect extraction. Yet the existing state-of-the-art CNN architectures used in aspect extraction do not incorporate improvements (e.g. non-static CNN, multi-kernel convolution layers, and dropout regularization) that have been identified as beneficial for general text classification tasks. In this research, we present an improved CNN architecture with these enhancements for aspect extraction. Our modifications to the basic CNN model improve feature extraction of the convolutional layer, while allowing the dense layers to represent complex non-linear relationships between selected features and the output layer. Furthermore, we show that using non-static CNN instead of static CNN further fine-tunes the word embedding features for the specific domain of customer reviews in the absence of domain-specific corpora to train word2Vec models. We show that using Skip-gram trained word2vec models opposed to Continuous bag of word (CBOW) architecture improves the quality of word2vec embedding features for aspect extraction and text classification tasks. This new CNN model and baseline CNN are evaluated using SemEval-2016 Task 5 Restaurant and Laptop domain datasets. Our CNN model shows significant improvements over the baseline CNN model for aspect extraction from customer reviews for both restaurant and laptop domains. It also outperforms the currently available state-of-the-art systems for restaurant domain."
        },
        {
            "title": "Multi-Domain Aspect Extraction using Support Vector Machines",
            "authors": "Nadheesh Jihan, <strong>Yasas Senarath</strong>, Dulanjaya Tennekoon, Mithila Wickramarathne, Surangika Ranathunga",
            "year": 2017,
            "conference": "29th Conference on Computational Linguistics and Speech Processing (ROCLING)",
            "description": "This paper describes a system to extract aspect categories for the task of aspect based sentiment analysis. This system can extract both implicit and explicit aspects. We propose a one-vs-rest Support Vector Machine (SVM) classifier preceded by a state of the art preprocessing pipeline. We present the use of mean embeddings as a feature along with two other new features to significantly improve the accuracy of the SVM classifier. This solution is extensible to customer reviews in different domains. Our results outperform the best recorded F1 score in the SemEval-2016 Task 5 dataset consisting of customer reviews from restaurant and laptop domains."
        }
    ]
}
